Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::ModifiableOpeningExtrusionParameters Class Referencefinal
Element Manager
#include <OpeningExtrusionParameters.hpp>
 Inheritance diagram for ACAPI::Element::ModifiableOpeningExtrusionParameters:
 Public Member Functions
void  | SetShapeType (const ShapeType polygonType)
Sets the the polygon type of the opening.
Result< void >  | SetWidth (double width)
Sets the width of the opening.
Result< void >  | SetHeight (double height)
Sets the height of the opening.
Result< void >  | SetLinkedStatus (const LinkedStatus linkedStatus)
Sets the linked status of the width and height value.
Result< void >  | SetConstraint (const Constraint constraint)
Sets the constraint of orientation of the extrusion body in the host element.
void  | SetAnchor (const API_AnchorID anchor)
Sets the anchor point tpye of the opening.
Result< void >  | SetAnchorAltitude (double anchorAltitude)
Sets the altitude of the anchor point of the opening.
void  | SetLimitType (const LimitType limitType)
Sets the limitation type of the extrusion body.
Result< void >  | SetExtrusionStartOffset (double extrusionStartOffset)
Sets the offset from the reference plane of the extrusion body.
Result< void >  | SetFiniteBodyLength (double finiteBodyLength)
Sets the length of the extrusion body if it is finite.
void  | SetEndSurfaceAttributeOverridden (bool isOverride)
Sets the overridden status of the Surface attribute of the End Surface.
void  | SetOverriddenEndSurfaceAttributeIndex (const API_AttributeIndex &attributeIndex)
Sets the overridden AttributeIndex of the Surface attribute of the End Surface.
void  | SetExtrusionSurfaceAttributeOverridden (bool isOverride)
Sets the overridden status of the Surface attribute of the Extrusion Surface.
void  | SetOverriddenExtrusionSurfaceAttributeIndex (const API_AttributeIndex &attributeIndex)
Sets the overridden AttributeIndex of the Surface attribute of the Extrusion Surface.
void  | SetOverriddenSurfaceAttributesLinked (bool linked)
Sets the linked status of the overridden end-surface and extrusion surface attributes.
 Public Member Functions inherited from ACAPI::Element::OpeningExtrusionParameters
ShapeType  | GetShapeType () const
std::optional< double >  | GetWidth () const
std::optional< double >  | GetHeight () const
std::optional< LinkedStatus >  | GetLinkedStatus () const
Constraint  | GetConstraint () const
API_AnchorID  | GetAnchor () const
std::optional< double >  | GetAnchorAltitude () const
LimitType  | GetLimitType () const
std::optional< double >  | GetExtrusionStartOffset () const
std::optional< double >  | GetFiniteBodyLength () const
bool  | IsEndSurfaceAttributeOverridden () const
API_AttributeIndex  | GetOverriddenEndSurfaceAttributeIndex () const
bool  | IsExtrusionSurfaceAttributeOverridden () const
API_AttributeIndex  | GetOverriddenExtrusionSurfaceAttributeIndex () const
bool  | AreOverriddenSurfaceAttributesLinked () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ModifiableOpeningExtrusionParameters (std::shared_ptr< Impl::OpeningExtrusionParametersBase > impl)
Constructs a ModifiableOpeningExtrusionParameters with an ExtrusionParameters implementation.
 Protected Member Functions inherited from ACAPI::Element::OpeningExtrusionParameters
OpeningExtrusionParameters (std::shared_ptr< Impl::OpeningExtrusionParametersBase > impl)
Constructs an OpeningExtrusionParameters with an OpeningExtrusionParameters implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 class  | OpeningDefault
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the modifiable extrusion parameters of an Opening element or an OpeningDefault element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ ModifiableOpeningExtrusionParameters()
 ACAPI::Element::ModifiableOpeningExtrusionParameters::ModifiableOpeningExtrusionParameters  |  ( |  std::shared_ptr< Impl::OpeningExtrusionParametersBase > |  impl | )
protected
Constructs a ModifiableOpeningExtrusionParameters with an ExtrusionParameters implementation.
Parameters
impl | The ExtrusionParameters implementation.
Member Function Documentation
◆ SetAnchor()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetAnchor  |  ( |  const API_AnchorID |  anchor | )
Sets the anchor point tpye of the opening.
Parameters
anchor | The anchor point of the opening.
◆ SetAnchorAltitude()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetAnchorAltitude  |  ( |  double |  anchorAltitude | )
Sets the altitude of the anchor point of the opening.
Parameters
anchorAltitude | The altitude of the anchor point of the opening.
Returns
Returns error if failed to set anchor altitude, nothing otherwise.
◆ SetConstraint()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetConstraint  |  ( |  const Constraint |  constraint | )
Sets the constraint of orientation of the extrusion body in the host element.
Parameters
constraint | The orientation of the extrusion body.
Returns
Returns error if failed to set constraint, nothing otherwise.
◆ SetEndSurfaceAttributeOverridden()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetEndSurfaceAttributeOverridden  |  ( |  bool |  isOverride | )
Sets the overridden status of the Surface attribute of the End Surface.
Parameters
isOverride | Whether the Surface attribute of the End Surface is overridden.
◆ SetExtrusionStartOffset()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetExtrusionStartOffset  |  ( |  double |  extrusionStartOffset | )
Sets the offset from the reference plane of the extrusion body.
Parameters
extrusionStartOffset | The offset from the reference plane of the extrusion body.
Returns
Returns error if failed to set extrusion start offset, nothing otherwise.
◆ SetExtrusionSurfaceAttributeOverridden()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetExtrusionSurfaceAttributeOverridden  |  ( |  bool |  isOverride | )
Sets the overridden status of the Surface attribute of the Extrusion Surface.
Parameters
isOverride | Whether the Surface attribute of the Extrusion Surface is overridden.
◆ SetFiniteBodyLength()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetFiniteBodyLength  |  ( |  double |  finiteBodyLength | )
Sets the length of the extrusion body if it is finite.
Parameters
finiteBodyLength | The length of the extrusion body.
Returns
Returns error if failed to set finite body length, nothing otherwise.
◆ SetHeight()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetHeight  |  ( |  double |  height | )
Sets the height of the opening.
Parameters
height | The height of the opening.
Returns
Returns an error if the polygon type is not Rectangular or Circular, nothing otherwise.
◆ SetLimitType()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetLimitType  |  ( |  const LimitType |  limitType | )
Sets the limitation type of the extrusion body.
Parameters
limitType | The type of the extrusion body.
◆ SetLinkedStatus()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetLinkedStatus  |  ( |  const LinkedStatus |  linkedStatus | )
Sets the linked status of the width and height value.
Parameters
linkedStatus | The width and height values are linked or not linked.
Returns
Returns error if failed to set linked status, nothing otherwise.
◆ SetOverriddenEndSurfaceAttributeIndex()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetOverriddenEndSurfaceAttributeIndex  |  ( |  const API_AttributeIndex & |  attributeIndex | )
Sets the overridden AttributeIndex of the Surface attribute of the End Surface.
Parameters
attributeIndex | The overridden AttributeIndex of the Surface attribute of the End Surface.
◆ SetOverriddenExtrusionSurfaceAttributeIndex()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetOverriddenExtrusionSurfaceAttributeIndex  |  ( |  const API_AttributeIndex & |  attributeIndex | )
Sets the overridden AttributeIndex of the Surface attribute of the Extrusion Surface.
Parameters
attributeIndex | The overridden AttributeIndex of the Surface attribute of the Extrusion Surface.
◆ SetOverriddenSurfaceAttributesLinked()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetOverriddenSurfaceAttributesLinked  |  ( |  bool |  linked | )
Sets the linked status of the overridden end-surface and extrusion surface attributes.
Parameters
linked | Whether the overridden end-surface and extrusion surface attributes are linked together.
◆ SetShapeType()
 void ACAPI::Element::ModifiableOpeningExtrusionParameters::SetShapeType  |  ( |  const ShapeType |  polygonType | )
Sets the the polygon type of the opening.
Parameters
polygonType | The type of the opening polygon.
◆ SetWidth()
 Result< void > ACAPI::Element::ModifiableOpeningExtrusionParameters::SetWidth  |  ( |  double |  width | )
Sets the width of the opening.
Parameters
width | The width of the opening.
Returns
Returns an error if the polygon type is not Rectangular or Circular, nothing otherwise.